def factorial(n):
    if n == 1 or n == 0:
        return 1
    else:
        return n * factorial(n - 1)

def C(n, k):
    c = factorial(n) / (factorial(k) * factorial(n - k))
    return c
    
def task_1():
    print("Завдання 1")
    print()
    
    print("Умова:")
    print("В магазин надійшла партія взуття одного фасону і розміру, але різного кольору. Партія містить 40 пар чорного кольору, 26 – коричневого, 22 – червоного і 12 пар синього. Коробки із взуттям виявились невідсортовані за кольором. Яка ймовірність того, що навмання взята коробка виявиться із взуттям червоного або синього кольору?")
    print()
    
    black = 40
    brown = 26
    red = 22
    blue = 12

    total = black + brown + red + blue
    
    Pred = red / total
    Pblue = blue / total
    
    P = Pred + Pblue
    print("Відповідь:", round(P, 3))  
    print("-------------------------------------------------------")
    print()
    
def task_2_3(task, total, special, select):
    if task == 2:
        print("Завдання 2")
        print()
        
        print("Умова:")
        print("У банку працює 10 співробітників, 8 з яких є консультантами. Знайти ймовірність того, що серед навмання вибраних двох співробітників, хоча б один буде консультантом.")
    elif task == 3:
        print("Завдання 3")
        print()
        
        print("Умова:")
        print("В компанії працює 10 менеджерів, серед яких двоє – родичі. Жеребкуванням вибирають трьох. Знайдіть ймовірність того, що серед вибраних фахівців буде принаймні один із родичів.")
    print()
    
    nonSpecial = total - special
    
    #обрати всі з протилежної події
    P0 = C(nonSpecial, select) / C(total, select)
    
    P = 1 - P0
    print("Відповідь:", round(P, 3))  
    print("-------------------------------------------------------")
    print()

def task_4():
    print("Завдання 4")
    print()
    
    print("Умова:")
    print("До мінімаркету з п’ятьма відділами прибував товар до одного з них. Ймовірність призначення товару для першого відділу р1=0,15, для другого р2=0,25, для третього р3=0,2, а для четвертого р4=0,1. Знайти ймовірність р5 того, що цей товар призначений для п’ятого відділу.")
    print()
    
    P1 = 0.15
    P2 = 0.25
    P3 = 0.2
    P4 = 0.1
    
    P = 1 - P1 - P2 - P3 - P4
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()

def task_5():
    print("Завдання 5")
    print()
    
    print("Умова:")
    print("У графіку руху потягів на дільниці є 120 колій для вантажних потягів. З цієї дільниці на станцію прибувають за розбіркою 80 потягів. Знайти ймовірність прибуття двох розбіркових потягів по двох сусідніх коліях.")
    print()
    
    railway = 120
    trains = 80
    
    P = C(trains, 2) / C(railway, 2)
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()

def task_6():
    print("Завдання 6")
    print()
    
    print("Умова:")
    print("Ймовірність виготовлення стандартного виробу даним станком дорівнює 0,9. Ймовірність появи виробу першого ґатунку серед стандартних виробів становить 0,8. Визначити ймовірність виготовлення виробу першого ґатунку даним станком.")
    print()
    
    Ps = 0.9
    P1s = 0.8 # серед стандартних
    
    P = 0.9 * 0.8
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()

def task_7():
    print("Завдання 7")
    print()
    
    print("Умова:")
    print("В групі з 10 студентів, які прийшли на екзамен, 3 підготовлені відмінно, 4 – добре, 2 – посередньо і 1 – погано. В екзаменаційних білетах є 20 питань. Студент, який підготовлений відмінно може відповісти на всі 20 питань, який підготовлений добре – на 16, посередньо – на 10, погано – на 5. Визваний навмання студент відповів на три довільно заданих питання. Знайти ймовірність того, що цей студент підготовлений: а) відмінно; б) погано.")
    print()
    
    total = 10
    perfect = 3
    good = 4
    normal = 2
    bad = 1
    
    # питання
    qTotal = 20
    qPerfect = 20
    qGood = 16
    qNormal = 10
    qBad = 5
    
    # імовірність дати правильну відповідь на всі 3 питання для студентів кожного рівня підготовки
    
    PPerfect = perfect / total * qPerfect / qTotal * (qPerfect - 1) / (qTotal - 1) * (qPerfect - 2) / (qTotal - 2)
    PGood = good / total * qGood / qTotal * (qGood - 1) / (qTotal - 1) * (qGood - 2) / (qTotal - 2)
    PNormal = normal / total * qNormal / qTotal * (qNormal - 1) / (qTotal - 1) * (qNormal - 2) / (qTotal - 2)
    PBad = bad / total * qBad / qTotal * (qBad - 1) / (qTotal - 1) * (qBad - 2) / (qTotal - 2)
    
    Psum = PPerfect + PGood + PNormal + PBad
    
    Pa = PPerfect / Psum
    Pb = PBad / Psum
    
    print("Відповідь:")
    print("a)", round(Pa, 3))
    print("b)", round(Pb, 4))
    print("-------------------------------------------------------")
    print()
    
def task_8():
    print("Завдання 8")
    print()
    
    print("Умова:")
    print("На трьох автоматизованих лініях виготовляють однакові деталі, причому 40% - на першій лінії, 30% - на другій та 30% - на третій. Ймовірність виготовлення стандартної деталі для цих ліній становить відповідно 0,9, 0,95 та 0,95. Виготовлені деталі надходять на склад. Яка ймовірність того, що навмання взята деталь стандартна?")
    print()
    
    # частка виготовлення деталей
    details1 = 0.4
    details2 = 0.3
    details3 = 0.3
    
    PStandard1 = 0.9
    PStandard2 = 0.95
    PStandard3 = 0.95
    
    # імовірність взяти деталь з кожної лінії
    P1 = details1 * PStandard1
    P2 = details2 * PStandard2
    P3 = details3 * PStandard3
    
    P = P1 + P2 + P3
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()
    
def task_9():
    print("Завдання 9")
    print()
    
    print("Умова:")
    print("У лікарню поступають (в середньому) 40% хворих на пневмонію, 30% -на перитоніт та 30% хворих на ангіну. Ймовірність повного одужання від пневмонії – 0,8; від перитоніту – 0,7 та ангіни – 0,85. Виписано хворого, який повністю одужав. Яка ймовірність того, що він був хворий на перитоніт?")
    print()
    
    pneumonia = 0.4
    peritonitis = 0.3
    angina = 0.3
    
    # імовірності одужання від хвороб
    pneum = 0.8
    perit = 0.7
    ang = 0.85
    
    # імовірність одужання
    Ppneum = pneumonia * pneum
    Pperit = peritonitis * perit
    Pang = angina * ang
    
    Psum = Ppneum + Pperit + Pang
    
    P = Pperit / Psum
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()
    
def task_10():
    print("Завдання 10")
    print()
    
    print("Умова:")
    print("30% приладів збирає фахівець високої кваліфікації і 70% середньої. Надійність роботи приладу, зібраного фахівцем високої кваліфікації 0,9, надійність приладу, зібраного фахівцем середньої кваліфікації 0,8. Взятий прилад виявився надійним. Визначити ймовірність того, що він зібраний фахівцем високої кваліфікації.")
    print()
    
    high = 0.3
    middle = 0.7
    
    reliabilityH = 0.9
    reliabilityM = 0.8
    
    # надійний прилад від кожного фахівця
    Ph = high * reliabilityH
    Pm = middle * reliabilityM
    
    # прилад надійний
    Psum = Ph + Pm
    
    P = Ph / Psum
    print("Відповідь:", round(P, 3))
    print("-------------------------------------------------------")
    print()

def mainf():
    task_1()
    
    task_2_3(2, 10, 8, 2)
    
    task_2_3(3, 10, 2, 3)
    
    task_4()
    
    task_5()
    
    task_6()
    
    task_7()
    
    task_8()
    
    task_9()
    
    task_10() 

mainf()